RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
#endif /*  LPSPI9  */

#if (defined(LPSPI10) || defined(LPSPI_10)) && defined(RTE_SPI10) && RTE_SPI10

/* User needs to provide the implementation for LPSPI10_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI10_GetFreq(void);

#if defined(LPSPI10)
static cmsis_lpspi_resource_t LPSPI10_Resource = {LPSPI10, 10, LPSPI10_GetFreq};
#elif defined(LPSPI_10)
static cmsis_lpspi_resource_t LPSPI10_Resource = {LPSPI_10, 10, LPSPI10_GetFreq};
#endif

#if defined(RTE_SPI10_DMA_EN) && RTE_SPI10_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI10_EdmaResource = {
    RTE_SPI10_DMA_TX_DMA_BASE,    RTE_SPI10_DMA_TX_CH,          (uint16_t)RTE_SPI10_DMA_TX_PERI_SEL,
    RTE_SPI10_DMA_RX_DMA_BASE,    RTE_SPI10_DMA_RX_CH,          (uint16_t)RTE_SPI10_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI10_DMA_TX_DMAMUX_BASE, RTE_SPI10_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI10_EdmaHandle);
static edma_handle_t LPSPI10_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI10_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi10_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI10_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI10_EdmaDriverState = {
#endif
    &LPSPI10_Resource,
    &LPSPI10_EdmaResource,
    &LPSPI10_EdmaHandle,
    &LPSPI10_EdmaRxRegToRxDataHandle,
    &LPSPI10_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI10_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI10_PIN_INIT
    RTE_SPI10_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaUninitialize(void)
{
#ifdef RTE_SPI10_PIN_DEINIT
    RTE_SPI10_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI10_EdmaDriverState);
}

static uint32_t LPSPI10_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI10_EdmaDriverState);
}

static int32_t LPSPI10_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI10_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI10_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI10_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI10_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi10_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI10_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI10_InterruptDriverState = {
#endif
    &LPSPI10_Resource,
    &LPSPI10_Handle,
};

static int32_t LPSPI10_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI10_PIN_INIT
    RTE_SPI10_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptUninitialize(void)
{
#ifdef RTE_SPI10_PIN_DEINIT
    RTE_SPI10_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI10_InterruptDriverState);
}

static uint32_t LPSPI10_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI10_InterruptDriverState);
}

static int32_t LPSPI10_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI10_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI10_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI10_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI10 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI10_DMA_EN) && RTE_SPI10_DMA_EN
    LPSPI10_EdmaInitialize, LPSPI10_EdmaUninitialize, LPSPI10_EdmaPowerControl, LPSPI10_EdmaSend,
    LPSPI10_EdmaReceive,    LPSPI10_EdmaTransfer,     LPSPI10_EdmaGetCount,     LPSPI10_EdmaControl,
    LPSPI10_EdmaGetStatus
#else
    LPSPI10_InterruptInitialize, LPSPI10_InterruptUninitialize, LPSPI10_InterruptPowerControl, LPSPI10_InterruptSend,
    LPSPI10_InterruptReceive,    LPSPI10_InterruptTransfer,     LPSPI10_InterruptGetCount,     LPSPI10_InterruptControl,
    LPSPI10_InterruptGetStatus
#endif
};

#endif /*  LPSPI10  */

#if (defined(LPSPI11) || defined(LPSPI_11)) && defined(RTE_SPI11) && RTE_SPI11

/* User needs to provide the implementation for LPSPI11_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI11_GetFreq(void);

#if defined(LPSPI11)
static cmsis_lpspi_resource_t LPSPI11_Resource = {LPSPI11, 11, LPSPI11_GetFreq};
#elif defined(LPSPI_11)
static cmsis_lpspi_resource_t LPSPI11_Resource = {LPSPI_11, 11, LPSPI11_GetFreq};
#endif

#if defined(RTE_SPI11_DMA_EN) && RTE_SPI11_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI11_EdmaResource = {
    RTE_SPI11_DMA_TX_DMA_BASE,    RTE_SPI11_DMA_TX_CH,          (uint16_t)RTE_SPI11_DMA_TX_PERI_SEL,
    RTE_SPI11_DMA_RX_DMA_BASE,    RTE_SPI11_DMA_RX_CH,          (uint16_t)RTE_SPI11_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI11_DMA_TX_DMAMUX_BASE, RTE_SPI11_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI11_EdmaHandle);
static edma_handle_t LPSPI11_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI11_EdmaRxRegToRxDataHandle;

