RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI12_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI12_EdmaDriverState);
}

static uint32_t LPSPI12_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI12_EdmaDriverState);
}

static int32_t LPSPI12_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI12_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI12_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI12_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI12_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi12_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI12_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI12_InterruptDriverState = {
#endif
    &LPSPI12_Resource,
    &LPSPI12_Handle,
};

static int32_t LPSPI12_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI12_PIN_INIT
    RTE_SPI12_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptUninitialize(void)
{
#ifdef RTE_SPI12_PIN_DEINIT
    RTE_SPI12_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI12_InterruptDriverState);
}

static uint32_t LPSPI12_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI12_InterruptDriverState);
}

static int32_t LPSPI12_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI12_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI12_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI12_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI12 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI12_DMA_EN) && RTE_SPI12_DMA_EN
    LPSPI12_EdmaInitialize, LPSPI12_EdmaUninitialize, LPSPI12_EdmaPowerControl, LPSPI12_EdmaSend,
    LPSPI12_EdmaReceive,    LPSPI12_EdmaTransfer,     LPSPI12_EdmaGetCount,     LPSPI12_EdmaControl,
    LPSPI12_EdmaGetStatus
#else
    LPSPI12_InterruptInitialize, LPSPI12_InterruptUninitialize, LPSPI12_InterruptPowerControl, LPSPI12_InterruptSend,
    LPSPI12_InterruptReceive,    LPSPI12_InterruptTransfer,     LPSPI12_InterruptGetCount,     LPSPI12_InterruptControl,
    LPSPI12_InterruptGetStatus
#endif
};

#endif /*  LPSPI12  */

#if (defined(LPSPI13) || defined(LPSPI_13)) && defined(RTE_SPI13) && RTE_SPI13

/* User needs to provide the implementation for LPSPI13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI13_GetFreq(void);

#if defined(LPSPI13)
static cmsis_lpspi_resource_t LPSPI13_Resource = {LPSPI13, 13, LPSPI13_GetFreq};
#elif defined(LPSPI_13)
static cmsis_lpspi_resource_t LPSPI13_Resource = {LPSPI_13, 13, LPSPI13_GetFreq};
#endif

#if defined(RTE_SPI13_DMA_EN) && RTE_SPI13_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI13_EdmaResource = {
    RTE_SPI13_DMA_TX_DMA_BASE,    RTE_SPI13_DMA_TX_CH,          (uint16_t)RTE_SPI13_DMA_TX_PERI_SEL,
    RTE_SPI13_DMA_RX_DMA_BASE,    RTE_SPI13_DMA_RX_CH,          (uint16_t)RTE_SPI13_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI13_DMA_TX_DMAMUX_BASE, RTE_SPI13_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI13_EdmaHandle);
static edma_handle_t LPSPI13_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI13_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi13_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI13_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI13_EdmaDriverState = {
#endif
    &LPSPI13_Resource,
    &LPSPI13_EdmaResource,
    &LPSPI13_EdmaHandle,
    &LPSPI13_EdmaRxRegToRxDataHandle,
    &LPSPI13_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI13_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI13_PIN_INIT
    RTE_SPI13_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaUninitialize(void)
{
#ifdef RTE_SPI13_PIN_DEINIT
    RTE_SPI13_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI13_EdmaDriverState);
}

static uint32_t LPSPI13_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI13_EdmaDriverState);
}

static int32_t LPSPI13_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI13_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI13_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI13_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI13_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi13_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI13_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI13_InterruptDriverState = {
#endif
    &LPSPI13_Resource,
    &LPSPI13_Handle,
};

static int32_t LPSPI13_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI13_PIN_INIT
    RTE_SPI13_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI13_InterruptDriverState);
}

static int32_t LPSPI13_InterruptUninitialize(void)
{
#ifdef RTE_SPI13_PIN_DEINIT
    RTE_SPI13_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI13_InterruptDriverState);
}

