RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI13_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI13_InterruptDriverState);
}

static int32_t LPSPI13_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI13_InterruptDriverState);
}

static int32_t LPSPI13_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI13_InterruptDriverState);
}

static int32_t LPSPI13_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI13_InterruptDriverState);
}

static uint32_t LPSPI13_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI13_InterruptDriverState);
}

static int32_t LPSPI13_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI13_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI13_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI13_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI13 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI13_DMA_EN) && RTE_SPI13_DMA_EN
    LPSPI13_EdmaInitialize, LPSPI13_EdmaUninitialize, LPSPI13_EdmaPowerControl, LPSPI13_EdmaSend,
    LPSPI13_EdmaReceive,    LPSPI13_EdmaTransfer,     LPSPI13_EdmaGetCount,     LPSPI13_EdmaControl,
    LPSPI13_EdmaGetStatus
#else
    LPSPI13_InterruptInitialize, LPSPI13_InterruptUninitialize, LPSPI13_InterruptPowerControl, LPSPI13_InterruptSend,
    LPSPI13_InterruptReceive,    LPSPI13_InterruptTransfer,     LPSPI13_InterruptGetCount,     LPSPI13_InterruptControl,
    LPSPI13_InterruptGetStatus
#endif
};

#endif /*  LPSPI13  */

#if (defined(LPSPI14) || defined(LPSPI_14)) && defined(RTE_SPI14) && RTE_SPI14

/* User needs to provide the implementation for LPSPI14_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI14_GetFreq(void);

#if defined(LPSPI14)
static cmsis_lpspi_resource_t LPSPI14_Resource = {LPSPI14, 14, LPSPI14_GetFreq};
#elif defined(LPSPI_14)
static cmsis_lpspi_resource_t LPSPI14_Resource = {LPSPI_14, 14, LPSPI14_GetFreq};
#endif

#if defined(RTE_SPI14_DMA_EN) && RTE_SPI14_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI14_EdmaResource = {
    RTE_SPI14_DMA_TX_DMA_BASE,    RTE_SPI14_DMA_TX_CH,          (uint16_t)RTE_SPI14_DMA_TX_PERI_SEL,
    RTE_SPI14_DMA_RX_DMA_BASE,    RTE_SPI14_DMA_RX_CH,          (uint16_t)RTE_SPI14_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI14_DMA_TX_DMAMUX_BASE, RTE_SPI14_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI14_EdmaHandle);
static edma_handle_t LPSPI14_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI14_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi14_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI14_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI14_EdmaDriverState = {
#endif
    &LPSPI14_Resource,
    &LPSPI14_EdmaResource,
    &LPSPI14_EdmaHandle,
    &LPSPI14_EdmaRxRegToRxDataHandle,
    &LPSPI14_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI14_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI14_PIN_INIT
    RTE_SPI14_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaUninitialize(void)
{
#ifdef RTE_SPI14_PIN_DEINIT
    RTE_SPI14_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI14_EdmaDriverState);
}

static uint32_t LPSPI14_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI14_EdmaDriverState);
}

static int32_t LPSPI14_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI14_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI14_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI14_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI14_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi14_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI14_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI14_InterruptDriverState = {
#endif
    &LPSPI14_Resource,
    &LPSPI14_Handle,
};

static int32_t LPSPI14_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI14_PIN_INIT
    RTE_SPI14_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI14_InterruptDriverState);
}

static int32_t LPSPI14_InterruptUninitialize(void)
{
#ifdef RTE_SPI14_PIN_DEINIT
    RTE_SPI14_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI14_InterruptDriverState);
}

static int32_t LPSPI14_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI14_InterruptDriverState);
}

static int32_t LPSPI14_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI14_InterruptDriverState);
}

static int32_t LPSPI14_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI14_InterruptDriverState);
}

static int32_t LPSPI14_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI14_InterruptDriverState);
}

static uint32_t LPSPI14_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI14_InterruptDriverState);
}

