RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI17_EdmaHandle);
static edma_handle_t LPSPI17_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI17_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi17_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI17_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI17_EdmaDriverState = {
#endif
    &LPSPI17_Resource,
    &LPSPI17_EdmaResource,
    &LPSPI17_EdmaHandle,
    &LPSPI17_EdmaRxRegToRxDataHandle,
    &LPSPI17_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI17_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI17_PIN_INIT
    RTE_SPI17_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaUninitialize(void)
{
#ifdef RTE_SPI17_PIN_DEINIT
    RTE_SPI17_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI17_EdmaDriverState);
}

static uint32_t LPSPI17_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI17_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI17_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI17_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI17_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi17_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI17_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI17_InterruptDriverState = {
#endif
    &LPSPI17_Resource,
    &LPSPI17_Handle,
};

static int32_t LPSPI17_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI17_PIN_INIT
    RTE_SPI17_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptUninitialize(void)
{
#ifdef RTE_SPI17_PIN_DEINIT
    RTE_SPI17_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI17_InterruptDriverState);
}

static uint32_t LPSPI17_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI17_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI17_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI17_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI17 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI17_DMA_EN) && RTE_SPI17_DMA_EN
    LPSPI17_EdmaInitialize, LPSPI17_EdmaUninitialize, LPSPI17_EdmaPowerControl, LPSPI17_EdmaSend,
    LPSPI17_EdmaReceive,    LPSPI17_EdmaTransfer,     LPSPI17_EdmaGetCount,     LPSPI17_EdmaControl,
    LPSPI17_EdmaGetStatus
#else
    LPSPI17_InterruptInitialize, LPSPI17_InterruptUninitialize, LPSPI17_InterruptPowerControl, LPSPI17_InterruptSend,
    LPSPI17_InterruptReceive,    LPSPI17_InterruptTransfer,     LPSPI17_InterruptGetCount,     LPSPI17_InterruptControl,
    LPSPI17_InterruptGetStatus
#endif
};

#endif /*  LPSPI17  */

#if (defined(LPSPI18) || defined(LPSPI_18)) && defined(RTE_SPI18) && RTE_SPI18

/* User needs to provide the implementation for LPSPI18_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI18_GetFreq(void);

#if defined(LPSPI18)
static cmsis_lpspi_resource_t LPSPI18_Resource = {LPSPI18, 18, LPSPI18_GetFreq};
#elif defined(LPSPI_18)
static cmsis_lpspi_resource_t LPSPI18_Resource = {LPSPI_18, 18, LPSPI18_GetFreq};
#endif

#if defined(RTE_SPI18_DMA_EN) && RTE_SPI18_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI18_EdmaResource = {
    RTE_SPI18_DMA_TX_DMA_BASE,    RTE_SPI18_DMA_TX_CH,          (uint16_t)RTE_SPI18_DMA_TX_PERI_SEL,
    RTE_SPI18_DMA_RX_DMA_BASE,    RTE_SPI18_DMA_RX_CH,          (uint16_t)RTE_SPI18_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI18_DMA_TX_DMAMUX_BASE, RTE_SPI18_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI18_EdmaHandle);
static edma_handle_t LPSPI18_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI18_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi18_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI18_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI18_EdmaDriverState = {
#endif
    &LPSPI18_Resource,
    &LPSPI18_EdmaResource,
    &LPSPI18_EdmaHandle,
    &LPSPI18_EdmaRxRegToRxDataHandle,
    &LPSPI18_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI18_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI18_PIN_INIT
    RTE_SPI18_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI18_EdmaDriverState);
}

static int32_t LPSPI18_EdmaUninitialize(void)
{
#ifdef RTE_SPI18_PIN_DEINIT
    RTE_SPI18_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI18_EdmaDriverState);
}

