RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI19_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI19_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI19_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI19_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI19_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi19_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI19_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI19_InterruptDriverState = {
#endif
    &LPSPI19_Resource,
    &LPSPI19_Handle,
};

static int32_t LPSPI19_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI19_PIN_INIT
    RTE_SPI19_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptUninitialize(void)
{
#ifdef RTE_SPI19_PIN_DEINIT
    RTE_SPI19_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI19_InterruptDriverState);
}

static uint32_t LPSPI19_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI19_InterruptDriverState);
}

static int32_t LPSPI19_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI19_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI19_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI19_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI19 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI19_DMA_EN) && RTE_SPI19_DMA_EN
    LPSPI19_EdmaInitialize, LPSPI19_EdmaUninitialize, LPSPI19_EdmaPowerControl, LPSPI19_EdmaSend,
    LPSPI19_EdmaReceive,    LPSPI19_EdmaTransfer,     LPSPI19_EdmaGetCount,     LPSPI19_EdmaControl,
    LPSPI19_EdmaGetStatus
#else
    LPSPI19_InterruptInitialize, LPSPI19_InterruptUninitialize, LPSPI19_InterruptPowerControl, LPSPI19_InterruptSend,
    LPSPI19_InterruptReceive,    LPSPI19_InterruptTransfer,     LPSPI19_InterruptGetCount,     LPSPI19_InterruptControl,
    LPSPI19_InterruptGetStatus
#endif
};

#endif /*  LPSPI19  */

#if (defined(LPSPI20) || defined(LPSPI_20)) && defined(RTE_SPI20) && RTE_SPI20

/* User needs to provide the implementation for LPSPI20_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI20_GetFreq(void);

#if defined(LPSPI20)
static cmsis_lpspi_resource_t LPSPI20_Resource = {LPSPI20, 20, LPSPI20_GetFreq};
#elif defined(LPSPI_20)
static cmsis_lpspi_resource_t LPSPI20_Resource = {LPSPI_20, 20, LPSPI20_GetFreq};
#endif

#if defined(RTE_SPI20_DMA_EN) && RTE_SPI20_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI20_EdmaResource = {
    RTE_SPI20_DMA_TX_DMA_BASE,    RTE_SPI20_DMA_TX_CH,          (uint16_t)RTE_SPI20_DMA_TX_PERI_SEL,
    RTE_SPI20_DMA_RX_DMA_BASE,    RTE_SPI20_DMA_RX_CH,          (uint16_t)RTE_SPI20_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI20_DMA_TX_DMAMUX_BASE, RTE_SPI20_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI20_EdmaHandle);
static edma_handle_t LPSPI20_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI20_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi20_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI20_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI20_EdmaDriverState = {
#endif
    &LPSPI20_Resource,
    &LPSPI20_EdmaResource,
    &LPSPI20_EdmaHandle,
    &LPSPI20_EdmaRxRegToRxDataHandle,
    &LPSPI20_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI20_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI20_PIN_INIT
    RTE_SPI20_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaUninitialize(void)
{
#ifdef RTE_SPI20_PIN_DEINIT
    RTE_SPI20_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI20_EdmaDriverState);
}

static uint32_t LPSPI20_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI20_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI20_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI20_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI20_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi20_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI20_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI20_InterruptDriverState = {
#endif
    &LPSPI20_Resource,
    &LPSPI20_Handle,
};

static int32_t LPSPI20_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI20_PIN_INIT
    RTE_SPI20_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptUninitialize(void)
{
#ifdef RTE_SPI20_PIN_DEINIT
    RTE_SPI20_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI20_InterruptDriverState);
}

