RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI20_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI20_InterruptDriverState);
}

static uint32_t LPSPI20_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI20_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI20_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI20_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI20 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI20_DMA_EN) && RTE_SPI20_DMA_EN
    LPSPI20_EdmaInitialize, LPSPI20_EdmaUninitialize, LPSPI20_EdmaPowerControl, LPSPI20_EdmaSend,
    LPSPI20_EdmaReceive,    LPSPI20_EdmaTransfer,     LPSPI20_EdmaGetCount,     LPSPI20_EdmaControl,
    LPSPI20_EdmaGetStatus
#else
    LPSPI20_InterruptInitialize, LPSPI20_InterruptUninitialize, LPSPI20_InterruptPowerControl, LPSPI20_InterruptSend,
    LPSPI20_InterruptReceive,    LPSPI20_InterruptTransfer,     LPSPI20_InterruptGetCount,     LPSPI20_InterruptControl,
    LPSPI20_InterruptGetStatus
#endif
};

#endif /*  LPSPI20  */
